src/cf/DataProcessors/НастройкаЗаполненияДатыОплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>НастройкаЗаполненияДатыОплаты</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Enums/ВариантыЗаполненияДатыОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыЗаполненияДатыОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеЗаполнять</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прибавлять</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ВидыДнейРасчетаДатыОтгрузки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДнейРасчетаДатыОтгрузки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Календарные</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочие</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/DataProcessors/НастройкаЗаполненияДатыОплаты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ПрограммныйИнтерфейс

// Формирует и возвращает текст с настройкой даты оплаты
//
// Параметры:
//	Договор - ДанныеФормыСтруктура
//
// Возвращаемое значение:
//	Строка - представление настройки даты оплаты
//
Функция ПолучитьЗаголовок(Договор = Неопределено) Экспорт
	
	Если (Договор <> Неопределено) Тогда		
		ВариантЗаполненияДатыОплаты = Договор.ВариантЗаполненияДатыОплаты;
		Если ВариантЗаполненияДатыОплаты = Перечисления.ВариантыЗаполненияДатыОтгрузки.НеЗаполнять Тогда
			Результат = НСтр("ru='Не заполнять'");
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;

	Результат = ЗаголовокНастроек(Договор);
	
	Возврат Результат;
	
КонецФункции

// Формирует и возвращает строку настроек расчета даты оплаты
//
// Возвращаемое значение:
//	Строка - список настроек через запятую 
//
Функция СписокНастроекДатыОплаты() Экспорт
	
	СписокНастроек = "ВариантЗаполненияДатыОплаты, ВидДнейРасчетаДатыОплаты,
		|КоличествоДнейРасчетаДатыОплаты, ПроизводственныйКалендарьРасчетаДатыОплаты";
	Возврат СписокНастроек;
	
КонецФункции

// Формирует и возвращает структуру настроек расчета даты оплаты
//
// Возвращаемое значение:
//	Структура - структура настроек 
//
Функция СтруктураНастроекДатыОплаты() Экспорт
	
	СписокНастроек = СписокНастроекДатыОплаты();
	СтруктураНастроек = Новый Структура(СписокНастроек);
	Возврат СтруктураНастроек;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
Функция ЗаголовокНастроек(Договор)
	
	СтруктураНастроек = СтруктураНастроекДатыОплаты();
	ЗаполнитьСтруктуруНастроек(СтруктураНастроек, Договор);

	УсловияОплаты = СтрокаУсловияОплаты(СтруктураНастроек);
	
	Возврат УсловияОплаты;
	
КонецФункции

Процедура ЗаполнитьСтруктуруНастроек(СтруктураНастроек, Договор)
	
	Если Договор <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(СтруктураНастроек, Договор);
	Иначе
		СписокНастроек = СписокНастроекДатыОплаты();
		НаборКонстант = Константы.СоздатьНабор(СписокНастроек);		
		НаборКонстант.Прочитать();
		ЗаполнитьЗначенияСвойств(СтруктураНастроек, НаборКонстант);
	КонецЕсли;
	
КонецПроцедуры

Функция СтрокаУсловияОплаты(СтруктураНастроек)
	
	Если НЕ ЗначениеЗаполнено(СтруктураНастроек.ВариантЗаполненияДатыОплаты) Тогда
		Возврат НСтр("ru='<Настройка не выполнена>'");
	КонецЕсли;
	
	Если СтруктураНастроек.ВариантЗаполненияДатыОплаты = Перечисления.ВариантыЗаполненияДатыОтгрузки.НеЗаполнять Тогда
		Возврат НСтр("ru='Не заполнять'");	
	КонецЕсли;	
		
	Результат = Новый Массив;

	Результат.Добавить(НРег(Строка(СтруктураНастроек.ВариантЗаполненияДатыОплаты)));
	Если СтруктураНастроек.ВидДнейРасчетаДатыОплаты = Перечисления.ВидыДнейРасчетаДатыОтгрузки.Календарные Тогда
		ТекстДней = НСтр("ru='календарный день'");
	Иначе
		ТекстДней = НСтр("ru='рабочий день'");
	КонецЕсли;
	
	СтрокаДней = ПолучитьСклоненияСтрокиПоЧислу(ТекстДней, СтруктураНастроек.КоличествоДнейРасчетаДатыОплаты,,
				"ЧС=Количественное", "ПД=Именительный")[0];
	Результат.Добавить(СтрокаДней);	
	
	ТекстДней = НСтр("ru='к дате документа'");
	Результат.Добавить(ТекстДней);
	
	РезультатСтрока = СтрСоединить(Результат, " ");
	Возврат РезультатСтрока;
	
КонецФункции

#КонецОбласти

#КонецЕсли
